Repository: giellalt/corpus-sme
Catalog: prestable/tmx/nob2sme/facta/skuvlahistorja2/eneste-s.htm.tmx
Source language: sme
Languages: nob

source: Muhto moadde jagi maŋŋel bođii skuvlii čálus : « Hálddahus buot áššiin mat gullet ruovttufidnui ( duodji , viessoindustriija ja smávvaindustriija ) sirdojuvvo Eanandoallodepartemeanttas Girko- ja oahpahusdepartementii suoidnemánu 1. b. 1955:s . »
nob: Men få år etter mottok skolen et rundskriv om at « administrasjonen av alle saker vedkomande heimeyrke ( husflid , husindustri og småindustri ) vert overført frå Landbruksdepartementet til Kyrkje- og undervisningsdepartementet frå 1. juli 1955 . »

source: 1935 rájes lei ruovttufidnoskuvllaid hálddahus ráđis " Landsrådet for heimeyrke " ( Ruovttofidnu riikkaráđđi ) .
nob: Fra 1935 lå administrasjonen av heimeyrkeskolene til Landsrådet for heimeyrke .

source: Dás ledje olbmot geat beroštedje seailluhit ja ovdánahttit boares dujiid ja giehtabargguid .
nob: Her satt det folk som var opptatte av å bevare og utvikle gammelt husflid og handverk .

source: Dát organiseren soittii leat mielde váikkuheame dasa ahte lei vejolaš sámi kultuvrra vuođul cegget sámi ruovttufidnoskuvlla .
nob: Denne organiseringa kan ha vært ei medvirkende årsak til at det var mulig å bygge den samiske heimeyrkeskolen på grunnlag av samisk kultur .

source: Skuvlla historjjá vuosttaš áigodagas ii leat mihkkege čállojuvvon mii čájeha ahte guovddáš eiseválddit geahččaledje rievdadit sisdoalu eanet nášuvnnalaš hápmái .
nob: I papira fra den første perioden i skolens historie er det ikke noe som tyder på at man fra sentrale myndigheter har forsøkt å presse skolen til å endre innholdet i mer nasjonal lei .

source: Ii lean dan áiggis goassege sáhka geavahit nášuvnnalaš oahppoplánaid .
nob: Det var i den tida aldri snakk om innføring av nasjonale læreplaner .

source: Vuosttaš jagiid ii lean ge eksámen skuvllas .
nob: De første åra blei det heller ikke holdt eksamen .

source: Čállosis skuvlajagis 1954/55:s muitaluvvo ahte dán rádjái ii leat čađahuvvon eksámen guđege fágas , muhto lea jurdda geahččalit čađahit eksámena giđđat 1955:s .
nob: Et skriv fra skoleåret 1954/55 forteller at det hittil ikke har vært eksamen i noen av fagene , men at man vil forsøke å få avholdt eksamen våren 1955 .

source: Dat čađahuvvui maid , ja Riikkaarkiivvas lea vurkejuvvon listu olggobealde váldon sensoriid namaiguin čuovvovaš fágain : Fidnooahppu dievdduide , čoarve- ja reaidoduodji , fidnooahppu nissoniidda , rehkenastin , ruhtadoallu , njálmmálaš ja čálalaš sámegiella ja sámi historjá .
nob: Dette blei da gjennomført , og i Riksarkivet er det bevart liste over oppnevnte eksterne sensorer for følgende fag : yrkeslære mannlig , horn- og redskapssløyd , yrkeslære kvinnelig , norsk , regning , bokføring , samisk muntlig og skriftlig og samisk historie .

source: Bastøy sajis
nob: I stedet for Bastøy

source: Vuosttažettiin lei ruovttufidnoskuvla eaktodáhtolaš fálaldat nuoraide geat ieža háliidedje oahpu .
nob: I all hovedsak var Heimeyrkeskolen et frivillig tilbud for ungdom som sjøl ønska utdanning .

source: Muhto unnimusat okte lea skuvla geavahuvvon dasa ahte njulget hilbes nuoraid dan sadjái go sáddet sin skuvlaruktui .
nob: Men i alle fall i ett tilfelle blei skolen brukt til å anbringe uskikkelig ungdom som et alternativ til bortsending til skolehjem .

source: Oanehis áiggi maŋŋel go skuvla lei álggahuvvon čálii Guovdageainnu várjalanráđđi reivve Oarje-Finnmárkku politimeasttirii .
nob: Nokså kort tid etter at skolen var starta skreiv Kautokeino verjeråd et brev til politimesteren i Vestfinnmark .

source: Dás čujuhuvvui ahte okta nuorra « galggai biddjot nu ( skuvlaruktui dehe sullásažžii ) movt Erenoamášskuvllaid direktoráhtta oinnii heivvolaččamussan » .
nob: Der viste man til at verjerådet hadde vedtatt at en ungdom « skulde anbringes på den måten ( skolehjem e.l. ) som Direktoratet for Spesialskolene fant mest tjenlig » .

source: Bárdni galggai sáddejuvvot Bastøy skuvlaruktui , muhto dasa bohte vuostecealkámušat : « Go šattai dovddusin dáppe ahte NN ( čihkkojuvvon namma , doaimm. ) galggai sáddejuvvot Bastøyai , de čájehedje oallugat sihke várjalanráđi siskkobealde ja olggobealde vuostehágu ja balu dasa .
nob: Gutten skulle sendes til Bastøy skolehjem i Oslofjorden , men det kom det protester mot : « Da det ble kjent heroppe at NN ( anonymisert av red. ) skulle til Bastøy , ga flere i som utenfor verjerådet uttrykk for sin misnøye og engstelse .

source: Maŋŋil ságastallamiid sunddiin Álttás , de lean mun guorahallan ahte lea go vejolaš oažžut su sajustit eará ládje , nu ahte son geahču vuolde beasašii oahppat juoidá mas sáhtášii oažžut ávkki maŋŋil eallimis , nugo vuogas barggu , ja gos son ii šatta « merkejuvvot » dan dihte go son boahtá sámi birrasis , iige gulahallan dárogillii .
nob: Etter konferanse med sorenskriveren i Alta undersøkte jeg så om det gaes anledning til å få ham anbragt på en annen måte , slik at han under skjerpet tilsyn kunne lære det han vilde få bruk for senere i livet , m. a. et høvelig yrke , og der han ikke kom til å bli « merket » fordi han var fra et samisk miljø og ubehjelpelig i norsk .

source: Maŋŋil máŋga geahččaleami duššás , rahpasii dán čavčča vejolašvuohta Guovdageainnu ođđa fidnoskuvllas . »
nob: Etter flere forgjeves forsøk hos andre , åpnet det seg i høst en slik adgang ved Kautokeino nystartede yrkesskole . »

source: Dasto mearriduvvui ahte bárdni galggai « biddjot Guovdageainnu fidnoskuvlii ... Jus bárdni aŋkke biehttala vuolgimis fidnoskuvlii dahje meannuda hejot , de sáddejuvvo dakkaviđe Bastøyai . »
nob: Det blei derfor vedtatt at gutten skulle « anbringes i Kautokeino yrkesskole . ... Skulde gutten mot formodning nekte å la seg anbringe i yrkesskolen eller vise dårlig framferd der , blir anbringelse i Bastøy skolehjem å effektuere uten videre . »

source: Reive Ovllái
nob: Brev til Ola

source: Álgojagiid sáhtte oahppit ohcat doarjaga oastit mašiinnaid ja duodjeneavvuid .
nob: De første åra kunne elevene søke støtte til innkjøp av maskiner og verktøy .

source: Sii sáhtte oažžut gitta 200 ruvnno rádjái , muhto de galge čállit ohcamuša fidnolávdegotti jođiheaddjái .
nob: De kunne få inntil 200 kroner , men da måtte de skrive søknad til lederen i yrkesnemnda .

source: Ohcamušat 1953:s leat vurkejuvvon skuvlla arkiivii , ja doppe sáhttá gávdnat máŋggalágán ohcamušaid .
nob: Søknadene fra 1953 er oppbevart i skolens arkiv .

source: Muhtimat ledje čujuhuvvon « Til Kautokeino Yrkesnemnd » ( Guovdageainnu fidnolávdegoddái ) , earát fas « Herr Ola Aarsethii » , ja soapmásat fas eanet eahpeformálalaččat , nugo dát ( originala reive lei dárogillii ) :
nob: Noen brev var stila « Til Kautokeino Yrkesnemnd » , andre til « Herr Ola Aarseth » , mens andre igjen var mer uformelle , som dette :

source: Guovdageaidnu 30/5
nob: Kautokeino 30/5

source: OVLLÁI Mun áigon dušše čállit dan ohcamuša birra , dahje dan mášiinna birra .
nob: Til Ola Jeg skulle bare skrive om den søkninga eller om den maskinen .

source: Ahte sáhttet diŋgot ođđa mašiinna ( Singer ) duolbmunmašiinna .
nob: At de kan bestille en ny maskin ( Singer ) trø maskin .

source: Go Elen Klemetsenas ii lean mašiidna vuovdit .
nob: For hun Elen Klemetsen hadde ingen maskin og selle .

source: Ola Aarseth lei Guovdageainnu skuvlahoavda , ja dasa lassin lei ruovttufidnoskuvlla stivrajođiheaddji Dás son lea joatkkaskuvlla ( framhaldsskuvlla ) bráhka ovddabealde 1950-logus. .
nob: Ola Aarseth var ved siden av å være skolesjef i Kautokeino også styreleder for heimeyrkeskolen . Her er han foran framhaldsskolebrakka på 1950-tallet .

source: ( Govva : Odd Mathis Hætta , Gáldu : Muitalusat ja dáhpahusat Guovdageainnus - Govvagirji IV )
nob: ( Foto : Odd Mathis Hætta , Kilde : Muitalusat ja dáhpahusat Guovdageainnus - Govvagirji IV )

source: Čoarvebázahusat Lørenskogii
nob: Hornkapp til Lørenskog

source: Ii lean álo nu buorre ruhtadilli skuvllas , ja danne geahččaledje veahkehit gáržžes skuvlabušeahta dan láhkái ahte vuvde visot maid sáhtte vuovdit .
nob: Det var ikke alltid lett for skolen å få endene til å møtes , og man forsøkte å spe på et spinkelt budsjett med å selge det som selges kunne .

source: Čoarveduojis báhce bázahusat maid ii sáhttán geavahit atnu- dahje čikŋabiergasiidda , ja jagi 1954:s čálii rektor reivve máŋggalágáš fabrihkáide ahte ostet go sii daid ávnnasin liibmii . Maŋimuš ožžo jođu A / S Norsk Benindustriai , guhte áiggui máksit 0,15 ruvnnu gilos , go leat buktojuvvon Lørenskog stašuvdnii Oslo lahka .
nob: Fra hornsløyden blei det en del kapp som ikke kunne brukes til bruks- eller prydgjenstander , og i 1954 skreiv rektor rundt til forskjellige fabrikker om de ville kjøpe opp dette som råstoff til lim. Til slutt fikk han tilslag i A / S Norsk Benindustri , som var villig til å betale kr. 0,15 pr. kg , levert Lørenskog stasjon ved Oslo .

source: Leaŋggat Ruonáeatnamii
nob: Bogtrær til Grønland

source: Juo álggu rájes oassálasttii skuvla riikkaidgaskasaš ovttasbarggus .
nob: Allerede helt i starten var skolen involvert i internasjonalt samarbeid .

source: 1954:s čálii Ruonáeatnandepartemeanta Københámmánis ja giitalii golmmaid leaŋggaid ovddas maid skuvlla oahppit ledje duddjon .
nob: I 1954 skreiv Grønlandsdepartementet i København og takka for tre par bogtrær for rein , som var forarbeida av skolens elever .

source: Erenoamáš čábbát duddjojuvvon heargeleaŋggat , Guovdageainnu gilišiljus .
nob: Spesielt forseggjort bogtre til rein , på Guovdageainnu gilišillju / Kautokeino bygdetun .

source: Várra ii lean seammá čábbát hervejuvvon leaŋga mii sáddejuvvui Ruonaeatnamii .
nob: Trulig var det ikke like dekorert det som blei sendt til Grønland .

source: ( Govva : Sállama sámegieloahppit )
nob: ( Foto : Samiskelever fra Sørøya )

source: Sámegiella skuvllas
nob: Samisk språk i skolen

source: Ruovttufidnoskuvla álggahuvvui 7 jagi ovdal go láhka rievdaduvvui nu ahte sámegiella lei lobálaš álbmotskuvllas ja 15 jagi ovdal go sámegiella čađahuvvogođii oahpahusgiellan álgooahpaheamis .
nob: Heimeyrkeskolen blei oppretta 7 år før loven blei endra slik at samisk kunne tillates i folkeskolen , og 15 år før samisk begynneropplæring blei gjennomført i praksis .

source: Lihkká lei sámegielfága plánejuvvon oassin ruovttufidnoskuvllas álggu rájes juo .
nob: Likevel var samisk som fag planlagt som en del av heimeyrkeskolen fra starten av .

source: Dát čađahuvvui maid , ja Anders Bongo lei oahpaheaddjin .
nob: Dette blei også gjennomført , og det var Anders Bongo som var lærer .

source: 1955:s ja 1956:s lei sámegiella maid eksámenfágan , ja sámekonsuleanta Hans J. Henriksen lei sensorin .
nob: I 1955 og 1956 var samisk også eksamensfag , med samekonsulent Hans J. Henriksen som sensor .

source: Su vuorkkás leat mii gávdnan eksámeniid árvosániid goappašit jagiid .
nob: I hans arkiv har vi funnet karakterene fra eksamen begge disse åra .

source: Árvosánit leat jámma buorit , muhto muhtin ohppiide lea sensora namuhan ahte dain ohppiin ferte leamaš beare heajos duogáš davvisámegielas ahte dáidda livččii sáhttán addit rievttalaš árvvoštallama .
nob: Karakterene er jevnt over gode , men for noen elever har sensor kommentert at disse elevene må ha hatt for dårlig bakgrunn i nordsamisk til at man kan gi en rettferdig vurdering .

source: 1955:s lei eksámena sisdoallu diktáhta ja stiila , ja 1956:s fas diktáhta ja jorgaleapmi .
nob: I 1955 besto eksamen av diktat og stil , i 1956 av diktat og oversettelse .

source: 1955 ' eksámena oktavuođas namuhii Henriksen čuovusreivves skuvlajođiheaddjái Sigurd Skoglundii : « Bongo ferte bargan ollu sámegieloahpahemiin . Dat oidno bohtosiin dušše snoagga 10 mánu sámegiela oahpaheamis obanassii , mii guoská čállimii ja riektačállimii » .
nob: I samband med eksamen i 1955 kommenterer Henriksen i et følgebrev til skolestyrer Sigurd Skoglund : « Bongo må ha lagt mye arbeid på samisk-opplæringen , det som vises er jo resultat av knapt 10 måneders undervisning overhodet i samisk , når det gjelder skrivning og ortografi . »

source: Ovtta eksámenčállosii lei sensor nu liikon ahte čállá : « Bivddán du árvvoštallat diktit stiilla maid oahppi nr. 2 lea čállán boahtit ávkin sámi lohkangirjái , dan maid Edel Eriksen dovdá go son lea miellahttu joavkkus geat leat čohkken čállosiid dasa .
nob: En av eksamensstilene har sensor blitt så begeistra for at han skriver : « Jeg ville gjerne be Dem overveie å la stilen til elev nr. 2 komme den samiske leseboka til nytte , den som Edel Eriksen kjenner til fordi hun er medlem av det utvalget som har samlet stoff til den .

source: Rievtti mielde leat čállosat dán girjái sáddejuvvon juo Girkodepartementii , muhto galggašii sáhttit oažžut dán bihtá dasa mielde , jus joavku nu háliida .
nob: Riktignok er stoffet til denne boka allerede sendt til Kirkedepartementet , men det skulle vel ennå la seg gjøre å få stykket inn , om utvalget så vil .

source: Lea go vejolaš ahte don divttát Edel Eriksena oaidnit dán stiilla ? »
nob: Har du anledning til å la Edel Eriksen se den stilen ? »

source: [ Dađe bahábut ii sáhte Skoglund leat dahkan dan , go Edel Hætta Eriksen muitala ahte son ii goassege ožžon dakkár stiilla .
nob: [ Dessverre kan ikke Skoglund ha gjort dette , for Edel Hætta Eriksen opplyser at hun aldri fikk noen slik stil .

source: Ii leat leamaš vejolaš gávdnat bargobihtáid ii ge vástádusaid . ]
nob: Det har ikke vært mulig å oppspore verken stiloppgavene eller besvarelsene . ]

source: 1955:s lei lassin sámegiela čálalaš eksámenii maiddái sámegiela njálmmálaš eksámen ja sámi historjá .
nob: I alle fall i 1955 var det i tillegg til samisk skriftlig også eksamen i samisk muntlig og samisk historie .

source: Sámegiella orru geavahuvvon ollu oahpahusgiellan .
nob: Samisk synes også i stor grad å ha vært brukt som undervisningsspråk .

source: Ii lean makkárge gáibádus geavahit dárogiela doppe gos sihke oahpaheaddjit ja oahppit ledje sámegielagat .
nob: Det var i alle fall ingen pålegg om å bruke norsk der lærere og elever var samisktalende .

source: Cuoŋománu 8. b. 1952:s cealká fidnoskuvllalávdegoddi : « Oahpahus berre eanemus lági mielde čađahuvvot sámegillii , goit praktihkalaš fágain . »
nob: 08.04.1952 uttaler yrkesskolenemnda : « Undervisningen bør i størst mulig utstrekning foregå på samisk , i alle fall i de praktiske fag . »

source: Vuosttaš jagiid ledje measta buot oahppit eret Guovdageainnus , ja nu ledje eanas oahppit sámegielagat .
nob: De første par åra var nesten alle elevene fra Kautokeino , dvs. at de aller fleste var samisktalende .

source: Maŋŋil boahtigohte oahppit maiddái eará guovlluin .
nob: Seinere kom det til flere fra andre områder .

source: Oassi sis eai máhttán sámegiela , dahje sámegiella maid sii máhtte lei nu earalágán go Guovdageainnu suopman ahte lei váttis dan ipmirdit .
nob: En del av dem kunne ikke samisk eller den samisken de kunne var for fjern fra kautokeinodialekten til at de kunne forstå denne .

source: Eanemus sámegiella geavahuvvui nieiddaid praktihkalaš oahpahusas .
nob: Mest bruk av samisk var det nok i den praktiske undervisninga for jenter .

source: Doppe ledje eanas sámegielat oahpaheaddjit .
nob: Her var lærerne for det meste samisktalende .

source: Snihkkároahpaheaddji ja skuvlajođiheaddji Skoglund ii máhttán sámegiela .
nob: Snekkerlærer og skolestyrer Skoglund kunne derimot ikke samisk .

source: Huksenplána ain maŋiduvvon
nob: Byggeplanen stadig utsatt

source: 50-logu álggogeahčen lei eanas oassi Davvi-Romssas ja Finnmárkkus ain huksema vuolde maŋŋel soađi .
nob: Først på 1950-tallet var mesteparten av Nord-Troms og Finnmark prega av gjenreising etter krigen .

source: Skuvllat ledje dávjá muhtunlágan bráhkain .
nob: Skolene holdt ofte til i provisoriske brakker .

source: Nu lei maid Guovdageainnus , ja go de galge álggahit ođđa skuvlla , de ii lean álki gávdnat saji .
nob: Slik var det også i Kautokeino , og når man så skulle etablere en ny skole , var det ikke bare å finne plass .

source: Álggos lei dievas ovttamielalašvuohta ahte deike ferte hukset ođđasa , muhto álge goitge gaskaboddosaš čovdosiiguin ; barggahagat iešguđetlágán bráhkáin ja teoriijaoahpaheapmi álbmotskuvllas eahkediid .
nob: Fra starten av var det full enighet om at det måtte bygges nytt , men man starta opp med provisoriske løsninger med verksteder i forskjellige brakker og teoriundervisning på folkeskolen på kveldstid .

source: Optimisttalaččat rehkenasttii plánenjoavku 1951:s ahte huksen sáhtii álggahuvvot 1952:s , muhto nie álki ii lean .
nob: Optimistisk nok regna plannemnda i 1951 med byggestart i 1952 . Men så lett skulle det ikke gå .

source: Stuoradiggeproposišuvdna nr. 1:s čuožžu : « Stuoradiggedieđáhusa nr. 85 ( 1951 ) mielde evttoha Eanadoallodepartemeanta ahte álggahuvvo sámi ruovttufidnoskuvla Guovdageidnui ja ahte huksemii internáhta ja skuvlavistti 1. huksenceahkkái , juolluduvvo 400 000,- ruvnno , ja dasa lassin 80 000,- ruvnno háhkamiidda ja doaibmagoluide , oktiibuot 480 000,- 1952/53 bušeahtas.»[Stortingsproposisjon nr. 1 , tillegg nr. 30 , 5. siidu lasáhusas . ]
nob: I Stortingsproposisjon nr 1–1952 blir det uttrykt : « . . i samsvar med St.meld. nr. 85 ( 1951 ) foreslår Landbruksdepartementet at det opprettes en samisk heimeyrkeskole i Kautokeino og at det til bygging av internat og skolebygg , 1. byggetrinn , bevilges kr. 400000 , samt til anskaffelse og driftsutgift kr. 80000 , tilsammen kr. 480000 på budsjettet for 1952–53.»[Stortingsproposisjon nr. 1 , tillegg nr. 30 , side 5 i tillegget . ]

source: Njukčamánu 27. beaivvi 1952 sádde plánenjoavku reivve Fylkkabargokántuvrii .
nob: 27.03.1952 sender plannemnda brev til Fylkesarbeidskontoret .

source: Dás leat ain optimisttat : « Huksemat vedjet álggahuvvot 1952 geasi . »
nob: Her er man fortsatt optimister : « Anleggene blir trolig påbegynt sommeren 1952 » .

source: Nu ii dáhpáhuvvan , ja stuoradiggeproposišuvdna 1-54 dieđiha : « Juolludeamis skuvlii sámiid várás , Guovdageainnus , ru. 480 000,- lea vel báhcán 409 000,- ruvnno jahkái 1953–54 .
nob: Dette skjedde ikke og Stortingsprop.1- 54 melder : « Av løyvinga til skulen for samar , Ktk , kr. 480000 er att kr. 409000 til overføring til 1953–54 .

source: Juolluduvvon supmi ja juolludeapmi jahkái 1953–54 , ru. 480 000,- de lea oktiibuot 889 000,- ruvnno geavaheapmái .
nob: Med den overførte sumen og løyvinga for 1953–54 , kr. 480000 , står det til rådvelde ialt kr. 889000 .

source: Departemeanta rehkenastá ahte ii dárbbašuvvo juolludeapmi jahkái 1954-55 , muhto ahte sáhttit máhccat gažaldahkii maŋŋel . »
nob: Dept. reknar med at det ikkje trengst løyving for 1954–55 , men at ein kan koma attende til spørsmålet seinare . »

source: Huksen ii álggahuvvon vel 1953:s ge , go njukčamánus 20. b. čálii Finnmarksposten : « Ođđa bistevaš vistti ceggegohtet dán geasi . »
nob: Bygginga kom heller ikke i gang i 1953 , for 20.03.1954 meldte Finnmarksposten : « Nytt permanent bygg skal påbegynnes til sommeren . »

source: Muhto boahtte guovtti mánus ferte bissehuvvon . Go miessemánu 19. b. 1954:s bivdá skuvlajođiheaddji ruđa gaskaboddosaš čovdosii , go juo « skuvlla bistevaš visttit eai sáhte rehkenastot ceggejuvvot dán jagi . »
nob: Men i løpet av de neste to månedene må det ha kommet stoppordre , for 19.05.1954 ber skolestyreren om penger til provisorium , siden « skolens permanente bygninger ikke kunne påregnes oppført i år » .

source: Dál šattai oalle váttis dilli , ii lean dohkálaš čađahit skuvlla dákkár dilálašvuođas .
nob: Nå begynte situasjonen å bli ganske fortvila , det var ikke holdbart å drive skole under slike forhold .

source: Maiddái fámut olggobealde skuvlla beroštišgohte áššis .
nob: Også krefter utafor skolen engasjerte seg .

source: Finnmárkku Sámi Ráđđi čálii borgemánu 1954:s reivve Eanandoallodepartementii ja váiddii go huksen ii lean vel álggahuvvon .
nob: Samisk råd for Finnmark skreiv 16.08.1954 til Landbruksdepartementet og klaga over at bygginga ennå ikke er kommet i gang .

source: Maŋŋel go guorahalle dárbbu , de čállojuvvo vel viidáseappot : « Ii oro jáhkehahtti ahte leat ruđat maid stáhta ii nagot juolludit .
nob: Etter ei utredning om behovet , heter det videre : « En får seg ikke til å tro at det er midlene Staten har vanskelig for å skaffe til veie .

source: Sáhttá jearrat galget go sápmelaččat ain čujuhuvvot Sámemiššuvnna skeaŋkkaide go lea sáhka ruđas ja kultuvrralaš ásahusain .
nob: En spør om samer fremdeles skal være henvist til Finnemisjonens gaver når det gjelder økonomiske spørsmål og kulturelle institusjoner .

source: Sámi ráđđi áigu mearkkašuhttit ahte eahpida Norgga stáhtafámuid oaidnit sámiid váttisvuođaid dainna duođalašvuođain , masa unna olmmoščearddažis , iežas mihtilmas árbevieruiguin , lea vuoigatvuohta , dákkár nuppástuhttináigodagas mii dál lea sámiid ovddabealde , mas leat nu stuora váikkuhusat . ...
nob: Samisk råd vil bemerke at en drar i tvil om de norske statsmakter ser på det samiske problem med det alvor som en liten folkegruppe med særegne tradisjoner har krav på i en omstillingsperiode av så dyptgripende karakter som den samene nå står over for . ...

source: Ráđđi bivdá dasto ahte gudnejahttojuvvon eanandoallodepartemeanta juolluda dárbbašlaš ruhtameari hukset bistevaš visttiid Stáhta ruovttufidnoskuvlii , nu ahte huksen sáhttá álggahuvvot 1955 ' giđa . »
nob: Rådet tillater seg derfor på det instendigste henstille til det ærede landbruksdepartement at det utvirker nødvendige bevilgninger til bygging av permanente lokaler for Statens heimeyrkeskole for samer i Kautokeino , slik at byggingen kan komme i gang fra våren 1955 . »

source: Jagi maŋŋel čállá aviisa Nationen geassemánu 3. beaivve 1955:s : « Lea doaivva ahte ruovttufidnoskuvla sápmelaččaid várás sáhttá huksejuvvot juo boahtte geasi . »
nob: Men neste år kan så Nationen 03.06.1955 skrive : « Håp om at Heimeyrkeskolen for samer kan bygges allerede neste sommer . »

source: 1955:s čálii aviisa Nationen ahte lei doaiva skuvlla hukset 1956:s .
nob: I 1955 skreiv avisa Nationen at det var håp om at skolen kunne bygges i 1956 .

source: Liikká ii lean válmmas geavahussii ovdal go 1960 .
nob: Likevel var den ikke klar for bruk før i 1960 .

source: Mánu maŋŋel mearrida skuvlastivra garra cealkámuša mas čuožžu : « Ruovttufidnoskuvla sápmelaččaid várás lea dál 3 jagi doallan kurssaid gaskaboddosaš visttiin , ja heajos dilis .
nob: En måned seinere vedtar skolens styre en krass uttalelse der det heter : « Heimeyrkeskolen for samer har nå i 3 år holdt kurs i provisoriske lokaler og under kummerlige forhold .

source: Leat goitge joatkán go ain leat ožžon lohpái ahte ođđa visttit huksejuvvojit .
nob: En har imidlertid holdt det gående da en stadig er blitt forespeilet at nybygget skulle påbegynnes .

source: Go čađat maŋidit ja gesset ruovttoluotta osiid juolluduvvon ruđain , de dat dagaha eahpesihkarvuođa skuvlla ja dan boahtteáiggi birra .
nob: De stadige utsettinger og nå inndragningen av en del av bevilgningen har skapt usikkerhet omkring skolen og dens framtid .

source: Dát áššit leat billistan skuvlla nama ja dahkan eahpádusa eiseválddiid dáhttui čađahit plána hukset ruovttufidnoskuvlla sámiide . »
nob: Disse ting har skadet skolen i folks omdømme og skapt tvil om myndighetenes vilje til å gjennomføre planen om Heimeyrkeskolen for samer . »

source: 1956:s gávnnaha skuvlla stivra dilálašvuođa nu váttisin ahte mearridit bissehit skuvlema gitta dassážii go ođđa visti lea gárvvis .
nob: I 1956 finner skolens styre forholda så uholdbare at de vedtar å stanse drifta av skolen inntil nybygget er ferdig .

source: Skuvlajođiheaddji ohcá eará skuvlii barggu , ja čuovvovaš jagiid lágidit dušše muhtin oanehis kurssaid maid skuvlla stivra hálddaša .
nob: Skolestyreren søker seg i mellomtida til en annen skole , og de neste åra er den eneste aktiviteten kortere kurs som blir administrert av skolens styre .
